[
  {
    "id": "ent_001",
    "title": "SSO Integration",
    "description": "Implement SAML/OIDC-based single sign-on for enterprise customers — sales has three deals pending on this, so no pressure.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "self_serve_growth",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "SSO is live and three deals close within 30 days; someone writes \"great job\" in all-hands.",
      "partial_success": "OIDC works but SAML attribute mapping is still manual per client and sales stops complaining in steering meetings; we declare victory and move on.",
      "unexpected_impact": "SSO exposed a critical session-management flaw and forced an auth refactor; it wasn't in the deck, but sure.",
      "soft_failure": "SSO is functional but admin UX is confusing enough to require a two-hour setup call per customer; a retro bullet absorbs the pain.",
      "catastrophe": "A SAML metadata config error provisioned all users at one customer as admins; legal wants a meeting."
    }
  },
  {
    "id": "ent_002",
    "title": "SCIM User Provisioning",
    "description": "Build a SCIM 2.0 endpoint for automated user provisioning and deprovisioning — three late-stage prospects are literally waiting.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "SCIM launched and all three pending enterprise deals closed in month one; the exec summary suddenly has room.",
      "partial_success": "SCIM works but attribute mapping is manual — two deals move forward anyway; the footnote does the heavy lifting.",
      "unexpected_impact": "SCIM exposed inconsistencies between roles and permissions nobody knew existed; the roadmap did not mention this part.",
      "soft_failure": "SCIM is live but only one customer deploys it; the postmortem gets a new slide.",
      "catastrophe": "A race condition left 300 deprovisioned users active; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "ent_003",
    "title": "Role-Based Access Control",
    "description": "Design and implement granular role-based permissions (admin, viewer, editor, auditor, plus custom roles) so access control stops being a spreadsheet.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "RBAC is live with predefined roles and a custom builder; leadership takes a victory lap.",
      "partial_success": "Predefined roles work but custom roles need engineering help, so customers adapt their orgs to our model; we call it progress.",
      "unexpected_impact": "The permission schema created edge cases with inheritance and delegation; we pretend that was the plan.",
      "soft_failure": "RBAC works but the admin UI is cluttered — customers email support about permission-denied errors that each take 30 minutes to diagnose; we blame 'execution risk'.",
      "catastrophe": "A role inheritance bug granted unintended permissions to 12% of users at a large customer; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_004",
    "title": "Comprehensive Audit Logging",
    "description": "Implement detailed audit logs for all entity changes, with filtering, export, and tamper-proof storage.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Audit logs are comprehensive and immutable; it becomes a QBR 'win'.",
      "partial_success": "Most changes are logged but custom integrations are not — auditors noted the gap; it still makes the slide deck.",
      "unexpected_impact": "Audit log storage grew faster than anyone projected and we had to compress retroactively; nobody had that in the model.",
      "soft_failure": "Audit logs work but search and filtering are painfully slow on large datasets; it goes into the learning pile.",
      "catastrophe": "A retention misconfig deleted logs that were supposed to be immutable; update your resume."
    }
  },
  {
    "id": "ent_005",
    "title": "Custom Branding & White-Label",
    "description": "Allow enterprise customers to customize UI colors, logos, email templates, and domain branding so it looks like they built it themselves.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "self_serve_growth",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "White-label branding shipped and both prospects converted; someone writes \"great job\" in all-hands.",
      "partial_success": "UI rebranding works but emails and embedded widgets still show our logo; we declare victory and move on.",
      "unexpected_impact": "Brand customization multiplied UI variants and visual regression testing became a weekly ritual; it wasn't in the deck, but sure.",
      "soft_failure": "Branding works but requires engineering per customer to wire custom CSS; a retro bullet absorbs the pain.",
      "catastrophe": "A caching issue served one customer's branding to another for six hours; legal wants a meeting."
    }
  },
  {
    "id": "ent_006",
    "title": "Data Residency Compliance",
    "description": "Support data residency requirements so customer data stays within specific geographic regions (EU, US, APAC) — because sovereignty is not optional.",
    "category": "enterprise_feature",
    "effort": 8,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        9,
        12
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Data residency is configurable at onboarding; the exec summary suddenly has room.",
      "partial_success": "Residency works for primary databases but analytics still run on shared infra — the DACH customer accepted a compliance addendum; the footnote does the heavy lifting.",
      "unexpected_impact": "Residency added latency to cross-region operations; the roadmap did not mention this part.",
      "soft_failure": "Residency is implemented but region selection is unclear — three customers picked the wrong one; the postmortem gets a new slide.",
      "catastrophe": "Replication lag corrupted the EU backup during a failover test, and recovery required seven-day-old snapshots; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "ent_007",
    "title": "Enterprise SLA Dashboard",
    "description": "Build a customer-facing dashboard showing uptime, incident response times, and SLA metrics in real-time — the transparency no one asked for until procurement did.",
    "category": "enterprise_feature",
    "effort": 5,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        6,
        10
      ],
      "partial": [
        3,
        5
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "SLA dashboard launched with real-time uptime and response times; leadership takes a victory lap.",
      "partial_success": "The dashboard exists but calculations are still manual and update every 24 hours; we call it progress.",
      "unexpected_impact": "The dashboard showed tickets closing in 18 hours against a 12-hour SLA; we pretend that was the plan.",
      "soft_failure": "The dashboard works but the visuals confuse everyone; we blame 'execution risk'.",
      "catastrophe": "A calculation error reported 99.98% uptime during 47 minutes of downtime; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_008",
    "title": "Enterprise Admin Console",
    "description": "Build a dedicated admin portal for enterprise customers to manage users, audit logs, integrations, and security settings from one place instead of six.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "self_serve_growth",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Admin console launched with all promised features and enterprise customers moved workflows into it within weeks; it becomes a QBR 'win'.",
      "partial_success": "The console covers about 70% of use cases; it still makes the slide deck.",
      "unexpected_impact": "The console got so feature-rich that customers asked for API access to automate console actions; nobody had that in the model.",
      "soft_failure": "The console shipped but the IA is confusing and customers click through nested menus to find basic settings; it goes into the learning pile.",
      "catastrophe": "A permission bug let lower admins view and modify restricted settings; update your resume."
    }
  },
  {
    "id": "ent_009",
    "title": "Bulk User Management",
    "description": "Enable bulk import and export of users, data, and configs via CSV and API so enterprise onboarding doesn't require a full-time coordinator.",
    "category": "enterprise_feature",
    "effort": 5,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        6,
        10
      ],
      "partial": [
        3,
        5
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Bulk import is live and enterprises onboard hundreds of users in minutes instead of hours; someone writes \"great job\" in all-hands.",
      "partial_success": "Bulk import works for basic creation but custom attributes still need manual entry — helpful, not fully self-serve; we declare victory and move on.",
      "unexpected_impact": "Bulk import exposed customer data quality issues; it wasn't in the deck, but sure.",
      "soft_failure": "Bulk import is sound but gives no feedback until completion; a retro bullet absorbs the pain.",
      "catastrophe": "A race condition processed the same CSV twice, creating 4,000 duplicate users; legal wants a meeting."
    }
  },
  {
    "id": "ent_010",
    "title": "Custom API Rate Limits",
    "description": "Let enterprise customers request higher API rate limits with monitoring and alerts, because apparently the default limits are 'insulting.'",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Custom rate limits are live and the scaling customer hits targets without throttling; leadership takes a victory lap.",
      "partial_success": "Custom limits work but require manual provisioning per customer; we call it progress.",
      "unexpected_impact": "Higher limits exposed wildly inefficient API usage — instead of optimizing, the customer asked for even higher limits; we pretend that was the plan.",
      "soft_failure": "Custom limits exist but the customer did not know they could request them; we blame 'execution risk'.",
      "catastrophe": "A calculation error set one customer's limit 100x too high; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_011",
    "title": "Dedicated Support Portal",
    "description": "Build a customer-facing portal where enterprise customers can submit, track, and escalate support tickets without emailing anyone.",
    "category": "enterprise_feature",
    "effort": 5,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        6,
        10
      ],
      "partial": [
        3,
        5
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Support portal launched with ticket tracking and SLA transparency; it becomes a QBR 'win'.",
      "partial_success": "The portal works for basic submissions but escalation paths are still manual — complex issues route inconsistently; it still makes the slide deck.",
      "unexpected_impact": "The portal exposed response-time differences by customer size; nobody had that in the model.",
      "soft_failure": "The portal exists but adoption is low; it goes into the learning pile.",
      "catastrophe": "A sync error marked resolved tickets as awaiting customer response for weeks; update your resume."
    }
  },
  {
    "id": "ent_012",
    "title": "SOC 2 Compliance Mode",
    "description": "Implement compliance features for SOC 2 Type II attestation — audit trails, access controls, the works — because enterprise deals die in procurement.",
    "category": "enterprise_feature",
    "effort": 8,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        9,
        12
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "ceo_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "SOC 2 Mode is live and verified by external auditors; someone writes \"great job\" in all-hands.",
      "partial_success": "Most requirements are met but immutable logging carries performance tradeoffs; we declare victory and move on.",
      "unexpected_impact": "Compliance infrastructure is expensive to maintain; it wasn't in the deck, but sure.",
      "soft_failure": "SOC 2 Mode is implemented but documentation is thin; a retro bullet absorbs the pain.",
      "catastrophe": "Auditors found that immutable logs were being deleted by retention; legal wants a meeting."
    }
  },
  {
    "id": "ent_013",
    "title": "HIPAA Compliance Features",
    "description": "Build HIPAA-required features: PHI encryption, access logging, retention policies, and breach notification, because healthcare customers do not negotiate on compliance.",
    "category": "enterprise_feature",
    "effort": 8,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        9,
        12
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "HIPAA features are live and verified by the customer's compliance team; the exec summary suddenly has room.",
      "partial_success": "Requirements are mostly met, but BAAs and ongoing training are mandatory; the footnote does the heavy lifting.",
      "unexpected_impact": "HIPAA constraints spread across the codebase and features that were simple now need PHI guardrails; the roadmap did not mention this part.",
      "soft_failure": "HIPAA features shipped but the customer's audit found gaps; the postmortem gets a new slide.",
      "catastrophe": "A data export included PHI in an unencrypted CSV and the customer's breach notification mentioned our platform; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "ent_014",
    "title": "Custom Reporting Engine",
    "description": "Build flexible reporting allowing enterprise customers to create custom dashboards and exports without engineering support.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "self_serve_growth",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Reporting engine is live and enterprise customers build custom reports in hours instead of weeks; leadership takes a victory lap.",
      "partial_success": "Common use cases are covered, but complex multi-table queries still require engineering and customers like the foundation; we call it progress.",
      "unexpected_impact": "Some customers built monster queries that caused performance issues; we pretend that was the plan.",
      "soft_failure": "The UI is powerful but overwhelming and customers use a small fraction of capabilities; we blame 'execution risk'.",
      "catastrophe": "A SQL injection vulnerability let a customer extract data they did not have permission to view; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_015",
    "title": "Advanced Permission Model",
    "description": "Implement end-to-end encryption for data at rest and in transit — because 'we take security seriously' should mean something.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Advanced permissions are live and the large customer deploys complex structures that match their org; it becomes a QBR 'win'.",
      "partial_success": "Most scenarios work but some delegation patterns need manual configuration and the customer adapts their org to the system; it still makes the slide deck.",
      "unexpected_impact": "Permission evaluation adds latency to every request; nobody had that in the model.",
      "soft_failure": "Advanced permissions are implemented but the UI is complex and customers need training; it goes into the learning pile.",
      "catastrophe": "A caching bug left a removed user with permissions for 72 hours; update your resume."
    }
  },
  {
    "id": "ent_016",
    "title": "Multi-Tenancy Isolation",
    "description": "Isolate enterprise tenants with guaranteed data separation, separate rate limits, and independent compliance posture.",
    "category": "enterprise_feature",
    "effort": 8,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        9,
        12
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Multi-tenancy shipped with guaranteed isolation and the financial services customer provisions three business units; someone writes \"great job\" in all-hands.",
      "partial_success": "Multi-tenancy works but analytics and backups still share infrastructure; we declare victory and move on.",
      "unexpected_impact": "Tenant-aware changes touched the entire platform — every feature now needs tenant context; it wasn't in the deck, but sure.",
      "soft_failure": "Multi-tenancy is implemented but a search bug briefly showed tenant A's users in tenant B's results — the customer spotted it immediately; a retro bullet absorbs the pain.",
      "catastrophe": "A backup restore loaded all tenant data into a single tenant; legal wants a meeting."
    }
  },
  {
    "id": "ent_017",
    "title": "Contract Management Integration",
    "description": "Support real-time streaming via webhooks and server-sent events so enterprise integrations can stop polling us every 30 seconds.",
    "category": "enterprise_feature",
    "effort": 5,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        6,
        10
      ],
      "partial": [
        3,
        5
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Contract data synced from Salesforce and renewal alerts fire 90 days out; the exec summary suddenly has room.",
      "partial_success": "Integration works but amendments do not sync automatically and sales updates records manually after changes; the footnote does the heavy lifting.",
      "unexpected_impact": "Salesforce data is stale by 2-3 days, so alerts occasionally fire at the wrong time; the roadmap did not mention this part.",
      "soft_failure": "Contract data is integrated but not prominent and sales keeps using Salesforce as the source of truth; the postmortem gets a new slide.",
      "catastrophe": "A sync error shifted contract end dates by 30 days for 18 customers; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "ent_018",
    "title": "Custom Data Retention",
    "description": "Let enterprise customers define custom data retention policies (delete or archive after N days) so their legal teams can sleep at night.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Custom retention policies are live; leadership takes a victory lap.",
      "partial_success": "Policies work but edge cases like child records need manual handling and the customer adapts; we call it progress.",
      "unexpected_impact": "Retention jobs at scale took longer than expected and hammered the database; we pretend that was the plan.",
      "soft_failure": "Policies are available but the UI is confusing and customers ask support to configure them; we blame 'execution risk'.",
      "catastrophe": "A retention bug applied policies in reverse: temporary data kept forever and important data deleted; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_019",
    "title": "Enterprise Onboarding Wizard",
    "description": "Build a guided, multi-step onboarding wizard for enterprise customers covering setup, provisioning, and integration config — handholding, but make it scalable.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "self_serve_growth",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "The onboarding wizard is live; it becomes a QBR 'win'.",
      "partial_success": "The wizard covers basic setup but complex integrations still need professional services and onboarding drops to 2-3 weeks; it still makes the slide deck.",
      "unexpected_impact": "The wizard makes choices that customers later want to undo; nobody had that in the model.",
      "soft_failure": "The wizard works but abandonment is high; it goes into the learning pile.",
      "catastrophe": "The integration step connected to customer systems using generic credentials; update your resume."
    }
  },
  {
    "id": "ent_020",
    "title": "Sandbox Environments",
    "description": "Provide customers with isolated sandbox instances for testing and development before deploying to production.",
    "category": "enterprise_feature",
    "effort": 6,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        7,
        11
      ],
      "partial": [
        3,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Sandboxes are available and enterprise customers clone production to test integrations safely; the exec summary suddenly has room.",
      "partial_success": "Sandboxes work but cloning takes four hours and needs manual credential rotation; the footnote does the heavy lifting.",
      "unexpected_impact": "Support requests for sandboxes became common; the roadmap did not mention this part.",
      "soft_failure": "Sandboxes exist but provisioning is not self-serve; the postmortem gets a new slide.",
      "catastrophe": "A cloning bug included a live production API key in a sandbox and the customer revoked it; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "ent_021",
    "title": "Approval Workflows",
    "description": "Implement configurable approval workflows for sensitive operations (data export, user access grants, contract changes).",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        6
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -3,
        -5
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "outcomes": {
      "clear_success": "Approval workflows are live and enterprise customers configure multi-stage approvals for sensitive operations; leadership takes a victory lap.",
      "partial_success": "Basic approvals work but escalation logic is manual — complex chains still require intervention; we call it progress.",
      "unexpected_impact": "Approval workflows add friction everywhere — tasks that took minutes now take hours; we pretend that was the plan.",
      "soft_failure": "Workflows exist but notifications are unreliable — approvers miss requests, so we fell back to email; we blame 'execution risk'.",
      "catastrophe": "A state-machine bug left requests stuck in pending indefinitely; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_022",
    "title": "Enterprise Support SLA Tiers",
    "description": "Define tiered support SLAs for enterprise customers (critical: 1hr, high: 4hr, normal: 24hr) so expectations are contractual instead of aspirational.",
    "category": "enterprise_feature",
    "effort": 5,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        6,
        10
      ],
      "partial": [
        3,
        5
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        3,
        6
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -4
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "SLA tiers are live and sales closes deals at three price points; it becomes a QBR 'win'.",
      "partial_success": "SLA tiers are defined but critical response times are missed 12% of the time due to staffing gaps; it still makes the slide deck.",
      "unexpected_impact": "Support burns out trying to meet critical SLAs; nobody had that in the model.",
      "soft_failure": "SLA tiers exist but tracking lives in a manual spreadsheet with low transparency; it goes into the learning pile.",
      "catastrophe": "A data entry error assigned a normal-tier customer to the critical SLA; update your resume."
    }
  },
  {
    "id": "ent_023",
    "title": "Security Questionnaire Export",
    "description": "Generate a standard security questionnaire export (hosting, encryption, access controls) for procurement reviews.",
    "category": "enterprise_feature",
    "effort": 3,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        4,
        7
      ],
      "partial": [
        2,
        3
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        2,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Questionnaire export shipped and procurement cycles shrink by weeks; someone writes \"great job\" in all-hands.",
      "partial_success": "Export works but uses last quarter's wording and sales sends it anyway; we declare victory and move on.",
      "unexpected_impact": "Security teams treat the export as the official source of truth; it wasn't in the deck, but sure.",
      "soft_failure": "Procurement wanted a spreadsheet, not a PDF; a retro bullet absorbs the pain.",
      "catastrophe": "The export claims encryption coverage we do not have and a prospect flags the gap; legal wants a meeting."
    }
  },
  {
    "id": "ent_024",
    "title": "Advanced Audit Logging",
    "description": "Build comprehensive audit logging for all user actions with tamper-proof storage — enterprise compliance teams live for this stuff.",
    "category": "enterprise_feature",
    "effort": 7,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        8,
        12
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "outcomes": {
      "clear_success": "Audit logging shipped and security questionnaires suddenly have more green checkmarks; leadership takes a victory lap.",
      "partial_success": "Logging works for core actions but edge cases are missing and we document those as known gaps; we call it progress.",
      "unexpected_impact": "Audit logs revealed internal admin actions that look suspicious to compliance teams; we pretend that was the plan.",
      "soft_failure": "Logging infrastructure exists but queries are slow and nobody uses it; we blame 'execution risk'.",
      "catastrophe": "Log storage filled the database and brought the system down for 90 minutes; this becomes a quarterly lesson."
    }
  },
  {
    "id": "ent_025",
    "title": "Role-Based Access Control v2",
    "description": "Current RBAC is binary (admin or user) — enterprise customers need granular permissions with custom roles and inheritance.",
    "category": "enterprise_feature",
    "effort": 8,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        9,
        13
      ],
      "partial": [
        4,
        7
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        5,
        7
      ],
      "partial": [
        2,
        4
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        4
      ]
    },
    "outcomes": {
      "clear_success": "RBAC v2 shipped with custom roles and enterprise deals close faster; someone writes \"great job\" in all-hands.",
      "partial_success": "Custom roles work but role inheritance is buggy and enterprise admins work around it; we declare victory and move on.",
      "unexpected_impact": "Granular permissions exposed gaps in the UI and users can configure roles that look valid but do nothing; it wasn't in the deck, but sure.",
      "soft_failure": "RBAC is powerful but so complex that customers request training sessions; a retro bullet absorbs the pain.",
      "catastrophe": "A permission inheritance bug granted admin rights to regular users for 6 hours; legal wants a meeting."
    }
  },
  {
    "id": "ent_026",
    "title": "Multi-Region Data Residency",
    "description": "Enterprise customers in the EU and APAC need data stored in-region for compliance — AWS bills are about to get interesting.",
    "category": "enterprise_feature",
    "effort": 9,
    "primary_metric": "enterprise_growth",
    "primary_impact": {
      "success": [
        11,
        15
      ],
      "partial": [
        5,
        9
      ]
    },
    "secondary_metric": "sales_sentiment",
    "secondary_impact": {
      "success": [
        6,
        8
      ],
      "partial": [
        3,
        5
      ]
    },
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": {
      "success": [
        5,
        7
      ],
      "partial": [
        3,
        5
      ]
    },
    "outcomes": {
      "clear_success": "Multi-region deployed and European deals that stalled for months suddenly close; leadership takes a victory lap.",
      "partial_success": "EU and US regions live; APAC delayed but we sell it anyway; we call it progress.",
      "unexpected_impact": "Regional data residency exposed latency issues when services cross regions and performance regressed; we pretend that was the plan.",
      "soft_failure": "Infrastructure exists but data replication is unreliable and manual intervention is common; we blame 'execution risk'.",
      "catastrophe": "A replication bug leaked EU customer data to US servers; this becomes a quarterly lesson."
    }
  }
]
