[
  {
    "id": "ux_001",
    "title": "Accessibility Audit Phase 1",
    "description": "WCAG 2.1 AA compliance review of core user flows. Identify missing alt text, aria labels, and keyboard navigation gaps across dashboard and settings.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [3, 5], "partial": [1, 2] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [1, 2], "partial": [0, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Three screen-reader users moved from frustrated to functional. Everyone else never noticed, which is the point.",
      "partial_success": "Alt text was added to 60% of images. The decorative ones are still screaming into the void.",
      "unexpected_impact": "We discovered 8% of users were blocked by color-only validation errors. We fixed it and pretended it was planned.",
      "soft_failure": "WCAG compliance achieved in staging. Production is a different legal question we are not discussing.",
      "catastrophe": "The audit revealed the settings page is completely inaccessible. Fixing it properly will cost 40 unbudgeted hours."
    }
  },
  {
    "id": "ux_002",
    "title": "Mobile Responsive Fixes",
    "description": "Address layout breaks on 375px and below viewports. Fix sticky headers, button hit targets, and modal overflow issues on iOS and Android.",
    "category": "ux_improvement",
    "effort": 4,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 6], "partial": [2, 3] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 3], "partial": [1, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Mobile NPS improved three points. Mobile users are now mostly frustrated instead of completely so.",
      "partial_success": "Buttons are tappable now. Modals still overflow, but we call that a scrolling experience.",
      "unexpected_impact": "Users on 6-inch phones report better navigation. Users on 5.4-inch phones report the same problems in different places.",
      "soft_failure": "Responsive design is now mostly compliant. There is a tablet breakpoint nobody owns anymore.",
      "catastrophe": "The sticky header fix broke input focus on iPhone 12. Support calls it a Safari quirk and we nod."
    }
  },
  {
    "id": "ux_003",
    "title": "Loading State Clarity",
    "description": "Replace vague spinners with contextual loading messages. Add skeleton screens to data-heavy pages and clarify estimated wait times.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 6], "partial": [1, 3] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [1, 3], "partial": [0, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Users stopped asking is it loading and started asking how much longer. This is what progress looks like.",
      "partial_success": "Skeleton screens exist on three pages. The other twelve still spin like they could mean anything.",
      "unexpected_impact": "One user thanked us for the loading message. Accounting for a full workday was apparently novel.",
      "soft_failure": "Loading states are more informative, but faster load times would be more informative still.",
      "catastrophe": "Estimated wait times are hardcoded to five seconds. Queries that take 45 seconds now look broken."
    }
  },
  {
    "id": "ux_004",
    "title": "Error Messages Rewrite",
    "description": "Replace technical error strings with actionable user guidance. Include specific next steps and relevant support links in all validation and API errors.",
    "category": "ux_improvement",
    "effort": 4,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 7], "partial": [2, 4] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 4], "partial": [1, 2] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Support tickets dropped 12% for common errors. Leadership credited an unrelated initiative.",
      "partial_success": "Form validation errors are now human readable. API errors still look like stack traces because that is someone else's system.",
      "unexpected_impact": "Users learned what a webhook is. The error message for it was better than our documentation.",
      "soft_failure": "The happy path is clearer and the unhappy path is still mystifying.",
      "catastrophe": "New error copy shipped with placeholder support links. Support got flooded with reports that we broke navigation."
    }
  },
  {
    "id": "ux_005",
    "title": "Color Contrast Audit",
    "description": "Ensure all text meets WCAG AA contrast ratios (4.5:1 for body text, 3:1 for large text). Remap palette for dark mode parity.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [3, 5], "partial": [1, 3] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "Users with low vision can read the interface now. The subtle gray-on-gray aesthetic is now merely subtle.",
      "partial_success": "Primary text passed AA. Secondary labels still fail on specific monitors and nobody checks because they are secondary.",
      "unexpected_impact": "The new palette accidentally made the app look more professional. Everyone thinks we rebranded.",
      "soft_failure": "Light mode is compliant. Dark mode is aspirationally accessible.",
      "catastrophe": "Remapping colors broke custom themes. Users with red-green colorblindness lost contrast in data visualizations."
    }
  },
  {
    "id": "ux_006",
    "title": "Keyboard Navigation Improvements",
    "description": "Implement tab order logic, focus indicators, and keyboard shortcuts for common actions. Add Skip to Content link on all pages.",
    "category": "ux_improvement",
    "effort": 4,
    "primary_metric": "nps",
    "primary_impact": { "success": [5, 7], "partial": [2, 4] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 3], "partial": [1, 2] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Power users found the shortcuts. One person is now 200% more efficient at a task nobody should optimize for.",
      "partial_success": "Tab order is logical on forms. Tab order in navigation is still mysterious.",
      "unexpected_impact": "A user without a mouse had a better experience. Everyone else uses a mouse, so this is invisible.",
      "soft_failure": "Keyboard navigation works in the main flow. Deep modals still have focus traps.",
      "catastrophe": "The Tab key now skips through 47 hidden elements before reaching content. Keyboard navigation is technically faster, if you are patient."
    }
  },
  {
    "id": "ux_007",
    "title": "Settings Page Redesign",
    "description": "Reorganize controls by feature area instead of alphabetically. Add preview panels for theme and layout changes. Group related toggles.",
    "category": "ux_improvement",
    "effort": 5,
    "primary_metric": "nps",
    "primary_impact": { "success": [5, 8], "partial": [2, 5] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 5], "partial": [1, 3] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Users found settings 40% faster. Settings still host 60% of bugs, but at least people reach them on purpose now.",
      "partial_success": "Settings are organized logically. The preview panel only works for themes, not for notifications or data retention.",
      "unexpected_impact": "Three users discovered features they did not know existed. Two of them were unintentional discoveries.",
      "soft_failure": "The redesign is an improvement over the previous chaos. It is still not self-explanatory.",
      "catastrophe": "Settings is now inviting enough that users tweak advanced options they do not understand. Support volume increased 8%."
    }
  },
  {
    "id": "ux_008",
    "title": "Empty State Design System",
    "description": "Create consistent messaging and illustrations for blank pages, zero-result searches, and no-data scenarios. Include onboarding hints for first-time contexts.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [3, 6], "partial": [1, 3] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [1, 3], "partial": [0, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "First-time users are no longer confused by blank screens. They are still confused by the next screen, but that is a different ticket.",
      "partial_success": "Empty states have helpful messages on 70% of pages. The other 30% still show nothing, which is somehow clearer.",
      "unexpected_impact": "The new illustrations became an internal meme. The design team's intent no longer matters.",
      "soft_failure": "Empty states are no longer bleak. They are now minimally encouraging in a way that feels passive-aggressive.",
      "catastrophe": "The no-data illustration offended roughly half the company. HR is now in a thread about it that will never end."
    }
  },
  {
    "id": "ux_009",
    "title": "Onboarding Tooltip Pass",
    "description": "Audit and refresh contextual tooltips on first-time feature discovery. Standardize tone, timing, and dismissal behavior across product.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 6], "partial": [1, 2] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [1, 2], "partial": [0, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Tooltips are consistent and helpful. New users still skip them because they are new users.",
      "partial_success": "Timing improved on critical flows. Half the tooltips still pop up mid-task to demand attention.",
      "unexpected_impact": "Someone customized tooltips for their account. It broke experiment metrics, but they are happy.",
      "soft_failure": "Tooltips are clearer but less discoverable. The tradeoff feels wrong even if the math says it is fine.",
      "catastrophe": "A tooltip bug shows the same message on different features. Users assume the features are the same. Support tickets followed."
    }
  },
  {
    "id": "ux_010",
    "title": "Search UX Overhaul",
    "description": "Add autocomplete suggestions, result previews, and filter chips. Implement fuzzy matching and recent search history. Show relevance ranking.",
    "category": "ux_improvement",
    "effort": 5,
    "primary_metric": "nps",
    "primary_impact": { "success": [6, 8], "partial": [3, 5] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 4], "partial": [1, 3] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Search success rate improved 28%. Users still get zero results sometimes and blame the product, not the query.",
      "partial_success": "Autocomplete works beautifully and fuzzy matching catches 85% of misspellings. The remaining 15% are user typos, not our problem.",
      "unexpected_impact": "Users discovered they can search for things that do not exist and are mad we made it easy to find nothing.",
      "soft_failure": "Search is faster but still not fast enough. Users perceive a 200ms delay with supernatural accuracy.",
      "catastrophe": "Recent search history leaked internal admin queries into user autocomplete. Privacy incident, low severity, still an incident."
    }
  },
  {
    "id": "ux_011",
    "title": "Form Validation Redesign",
    "description": "Move validation to real-time inline feedback instead of submit-time walls. Add success states for completed fields. Clarify required vs. optional.",
    "category": "ux_improvement",
    "effort": 4,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 6], "partial": [2, 4] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 3], "partial": [1, 2] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Form abandonment dropped 15%. Users still fill out fields they think are optional because they are not.",
      "partial_success": "Real-time validation works on text inputs. Dropdowns still validate on submit because the codebase is old.",
      "unexpected_impact": "A user sent a thank-you email about instant email validation. This is the only positive feedback we will get on this ticket.",
      "soft_failure": "Validation is friendlier but users still cannot tell if red means wrong or required without trying.",
      "catastrophe": "Success checkmarks are so cheerful that users submit incomplete forms thinking they are done. Form completion rate went up; actual completion rate went down."
    }
  },
  {
    "id": "ux_012",
    "title": "Dark Mode Implementation",
    "description": "Implement system preference detection and user toggle for dark mode. Audit color palette for WCAG compliance in both modes. Add persistent user preference.",
    "category": "ux_improvement",
    "effort": 5,
    "primary_metric": "nps",
    "primary_impact": { "success": [5, 8], "partial": [2, 4] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "tech_debt",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Night-shift NPS improved five points. Everyone else is happy we finally have dark mode because it makes the product look premium.",
      "partial_success": "Dark mode works, but some components were not updated. Light buttons on dark backgrounds are now a design choice.",
      "unexpected_impact": "OLED power consumption dropped. Nobody measured it and nobody will acknowledge it.",
      "soft_failure": "Dark mode is available but buggy in PDF exports. It is not a common use case, but someone is doing it.",
      "catastrophe": "Dark mode broke the custom theme system. Users with saved themes now live in an unusable gray void."
    }
  },
  {
    "id": "ux_013",
    "title": "Notification Center Redesign",
    "description": "Consolidate notifications from multiple sources into a unified center. Add filtering by type and priority. Implement notification preferences UI.",
    "category": "ux_improvement",
    "effort": 4,
    "primary_metric": "nps",
    "primary_impact": { "success": [4, 7], "partial": [2, 3] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 4], "partial": [1, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Notification overload dropped 40%. Users are now overwhelmed by fewer notifications instead of more.",
      "partial_success": "The center is unified. Preferences control only 60% of notification types because the other 40% are system-critical.",
      "unexpected_impact": "Users discovered they can silence notifications. Several people are now missing critical alerts they needed.",
      "soft_failure": "Notifications are better organized. Delivery still arrives in random order because the queue does what it wants.",
      "catastrophe": "The preferences UI is so good at hiding alerts that a critical security notification went unseen for two weeks."
    }
  },
  {
    "id": "ux_014",
    "title": "Page Transition Animations",
    "description": "Add smooth fade and slide transitions between major sections. Ensure animations respect prefers-reduced-motion. Keep motion under 300ms.",
    "category": "ux_improvement",
    "effort": 3,
    "primary_metric": "nps",
    "primary_impact": { "success": [3, 5], "partial": [1, 3] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Navigation feels smoother. Users on 2G connections experience brief freezes, which are technically animated.",
      "partial_success": "Transitions are smooth on modern browsers. Safari 2019 still looks choppy, but that is not our target audience.",
      "unexpected_impact": "One user with vestibular disorder disabled motion and thanked us. Everyone else got a nice visual polish.",
      "soft_failure": "Animations are under 300ms. Actual perceived delay is higher due to rendering, but metrics look good.",
      "catastrophe": "Animations caused layout shift on mobile. CLS went up, complaints went up, performance did not change."
    }
  },
  {
    "id": "ux_015",
    "title": "Data Table Redesign",
    "description": "Improve sortable columns, add column visibility toggle, implement sticky headers. Add row hover states and improve mobile card view for large tables.",
    "category": "ux_improvement",
    "effort": 5,
    "primary_metric": "nps",
    "primary_impact": { "success": [5, 8], "partial": [3, 5] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [2, 5], "partial": [1, 2] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Data-heavy workflows are 30% faster. Analysts are now impatient about the other 70% of the product.",
      "partial_success": "Tables are beautiful and functional. Sorting 500,000 rows still takes six seconds, but it feels snappier.",
      "unexpected_impact": "The column visibility toggle is so good that users hid critical columns and forgot they were hidden.",
      "soft_failure": "Tables are great on desktop. Mobile card view is a half-measure that is better than nothing but not ideal.",
      "catastrophe": "Sticky headers broke absolutely positioned elements inside cells. A critical reporting table is now unusable in ways that did not appear in testing."
    }
  },
  {
    "id": "ux_016",
    "title": "Empty State Microcopy",
    "description": "Rewrite empty states with clear next steps and example data. Tiny effort, clearer first-use experience. Tradeoff: you now own copy across a dozen surfaces.",
    "category": "ux_improvement",
    "effort": 2,
    "primary_metric": "nps",
    "primary_impact": { "success": [2, 4], "partial": [1, 2] },
    "secondary_metric": "self_serve_growth",
    "secondary_impact": { "success": [1, 2], "partial": [0, 1] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Empty states tell users exactly what to do next. Support tickets dropped and onboarding feels less like a scavenger hunt.",
      "partial_success": "Half the empty states are helpful, the other half still say no data. Users are less confused, but not unconfused.",
      "unexpected_impact": "Users copy the example data verbatim. Three demos now feature the same fictional customer name.",
      "soft_failure": "Copy is better, but setup is still hard. Users read the instructions and then abandon them.",
      "catastrophe": "A localization bug replaced empty-state copy with raw template tokens. Every screen looked broken in three languages and support lit up."
    }
  },
  {
    "id": "inf_001",
    "title": "CDN Migration Plan",
    "description": "Migrate static assets from self-hosted to global CDN. Implement cache headers and versioning. Reduce origin load and improve global latency by 40-60%.",
    "category": "infrastructure",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-6, -9], "partial": [-3, -6] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "APAC regions load 50% faster. The team is quietly pleased and immediately has three new ideas for things that could break.",
      "partial_success": "Most assets are on the CDN. SVG files are still self-hosted because nobody owns the icon system anymore.",
      "unexpected_impact": "Cache invalidation is now a problem we can see. Before, it was a problem we could not measure.",
      "soft_failure": "The CDN works but edge cases exist. Users in certain regions get stale assets for reasons we do not understand yet.",
      "catastrophe": "A CDN misconfiguration cached the API response. Every user saw the same data for 45 minutes. We deployed a fix at 3 AM on Saturday."
    }
  },
  {
    "id": "inf_002",
    "title": "Auto-Scaling Configuration",
    "description": "Set up horizontal pod autoscaling based on CPU and memory thresholds. Configure burst limits and cooldown periods. Test during peak hours.",
    "category": "infrastructure",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-5, -8], "partial": [-2, -5] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "The system scales automatically during traffic spikes. The team can sleep during peak hours, which is somehow terrifying.",
      "partial_success": "Auto-scaling works for stateless services. Stateful services still scale manually because that is more fun.",
      "unexpected_impact": "Cost increased during the test spike. We called it a valuable learning about what the system can handle.",
      "soft_failure": "Scaling works but takes 90 seconds to activate. Most spikes last 45 seconds.",
      "catastrophe": "A cascading failure caused rapid scale-out followed by rapid scale-in. Forty-seven pods started and died in six minutes. The team was paged four times."
    }
  },
  {
    "id": "inf_003",
    "title": "Database Read Replicas",
    "description": "Deploy read replicas for reporting and analytics queries. Implement connection pooling and replica failover. Offload 40% of read traffic from primary.",
    "category": "infrastructure",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-7, -10], "partial": [-3, -7] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Primary database CPU dropped 35%. The team is discussing next quarter's optimizations instead of firefighting.",
      "partial_success": "Read replicas work for analytics, but consistency adds 2-5 seconds of lag and breaks freshness expectations.",
      "unexpected_impact": "A user discovered they could query stale data from the replica, built a workflow around it, and complained when we fixed it.",
      "soft_failure": "Replicas work most of the time. During network partitions you choose between stale data and no data.",
      "catastrophe": "A replica fell out of sync with primary. For 40 minutes, analytics reported fabricated numbers. Nobody noticed until the CFO asked."
    }
  },
  {
    "id": "inf_004",
    "title": "Disaster Recovery Testing",
    "description": "Implement monthly DR drills simulating complete region failure. Test database restore, failover procedures, and RTO/RPO metrics. Document playbooks.",
    "category": "infrastructure",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-5, -7], "partial": [-2, -4] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "We discovered we could recover in 45 minutes. During the actual failure it took 12 hours. We are still analyzing why.",
      "partial_success": "DR playbooks exist. Half are outdated and reference systems that no longer exist.",
      "unexpected_impact": "The first drill broke production. Everyone learned something valuable about testing in staging.",
      "soft_failure": "Recovery procedures work but require manual steps and people who know the system, so they are fragile by nature.",
      "catastrophe": "A restore test corrupted the backup. We spent 36 hours discovering our disaster recovery plan was itself a disaster."
    }
  },
  {
    "id": "inf_005",
    "title": "Load Balancer Optimization",
    "description": "Tune connection limits, timeouts, and health check parameters. Implement connection draining for graceful shutdowns. Add request tracing headers.",
    "category": "infrastructure",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-5, -8], "partial": [-2, -4] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "Request routing is more efficient. Failed connections dropped 60%. Users experience fewer timeouts that were never real timeouts.",
      "partial_success": "Health checks are better. False positives still happen during GC pauses in production.",
      "unexpected_impact": "Tracing headers revealed users send malformed requests we never noticed. Everything still works anyway.",
      "soft_failure": "The load balancer is optimized. Deployments still cause brief resets because deploys happen at peak traffic.",
      "catastrophe": "The new timeout was too aggressive. Long-running reports failed and we did not notice for four hours."
    }
  },
  {
    "id": "inf_006",
    "title": "Log Aggregation Pipeline",
    "description": "Centralize logs from all services into distributed logging platform. Implement structured logging format. Set up retention, archival, and search indexes.",
    "category": "infrastructure",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-7, -10], "partial": [-3, -6] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Log searchability improved from nonexistent to useful. Debugging is now 40% less painful.",
      "partial_success": "Most services log correctly. Legacy services still write unstructured logs that make parsing impossible.",
      "unexpected_impact": "We can now see exactly how often users hit error paths. The numbers are higher than anyone expected.",
      "soft_failure": "Centralized logging works. Retaining six months of logs costs more than expected.",
      "catastrophe": "The logging pipeline started dropping events under load. Losing logs while fixing logging felt on brand."
    }
  },
  {
    "id": "inf_007",
    "title": "Container Orchestration Migration",
    "description": "Migrate from manual container management to Kubernetes. Set up stateful sets, config maps, and persistent volumes. Plan gradual service migration.",
    "category": "infrastructure",
    "effort": 7,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-8, -12], "partial": [-4, -7] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -4], "partial": [-1, -3] },
    "outcomes": {
      "clear_success": "Kubernetes now runs 80% of services. Infrastructure has job security for five more years of YAML.",
      "partial_success": "Orchestration works. PersistentVolume claims still glitch and require manual intervention.",
      "unexpected_impact": "Kubernetes manages resources so well that developers stopped thinking about resource usage entirely.",
      "soft_failure": "Services migrate smoothly until one stateful service sits in CrashLoopBackOff for three hours and confuses everyone.",
      "catastrophe": "A misconfigured StatefulSet replica corrupted data. Recovery took 18 hours and everyone learned Kubernetes is powerful in ways they did not expect."
    }
  },
  {
    "id": "inf_008",
    "title": "Blue-Green Deployment Setup",
    "description": "Implement blue-green deployment strategy for zero-downtime releases. Automate traffic switching and rollback procedures. Update CI/CD pipeline.",
    "category": "infrastructure",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-6, -9], "partial": [-3, -5] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Deployments happen without downtime and release anxiety dropped. Nobody mentioned that releases now take twice as long.",
      "partial_success": "Blue-green works for stateless services. Stateful services still require manual coordination.",
      "unexpected_impact": "Instant rollback made developers more confident about shipping. Bug fix velocity increased 25%.",
      "soft_failure": "Zero-downtime deploys work, but database migrations still require downtime windows.",
      "catastrophe": "A green deploy contained a load-only bug. Rollback took 90 seconds and felt eternal."
    }
  },
  {
    "id": "inf_009",
    "title": "Service Mesh Implementation",
    "description": "Deploy service mesh for inter-service communication, circuit breaking, and observability. Start with canary rollout to 20% of traffic. Monitor latency impact.",
    "category": "infrastructure",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-7, -10], "partial": [-3, -7] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Circuit breakers now prevent cascading failures. The infrastructure is resilient in ways impossible to appreciate on a quiet day.",
      "partial_success": "Service mesh is deployed to 20% of traffic. The remaining 80% is waiting while we debug slightly higher latency.",
      "unexpected_impact": "The mesh added 50ms of latency. We called it the cost of resilience.",
      "soft_failure": "The mesh works but adds complexity. Only two people understand its configuration.",
      "catastrophe": "A mesh rule misconfiguration caused traffic to loop. Services talked to themselves for eight minutes until retry storms crashed them."
    }
  },
  {
    "id": "inf_010",
    "title": "API Gateway Deployment",
    "description": "Deploy centralized API gateway for routing, rate limiting, and authentication. Replace direct service endpoints. Implement request/response transformations.",
    "category": "infrastructure",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-6, -9], "partial": [-3, -5] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "The API gateway is now the single point of control. Rate limiting works and developers immediately want to bypass it for special cases.",
      "partial_success": "The gateway routes traffic correctly. Authentication still happens at the service level because migration is incomplete.",
      "unexpected_impact": "Gateway metrics revealed that 30% of API traffic is from unknown sources. We are now in an information discovery phase.",
      "soft_failure": "The gateway works. It is another layer in the stack that can fail between user and service.",
      "catastrophe": "The rate limiter was too strict. Legitimate bulk operations got 429s for an hour during migration."
    }
  },
  {
    "id": "inf_011",
    "title": "Distributed Caching Layer",
    "description": "Deploy Redis cluster for distributed caching. Implement cache invalidation strategy and cache-aside patterns. Target 70% cache hit ratio.",
    "category": "infrastructure",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-6, -9], "partial": [-3, -6] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "Database load dropped 35%. Cache hit ratio is 75% and cached queries dropped from 200ms to 5ms.",
      "partial_success": "Caching works beautifully. Cache invalidation is still wrong in three places.",
      "unexpected_impact": "Redis became a single point of failure. We are not prepared for that failure.",
      "soft_failure": "Caching increases hits. Stale data is occasionally served but it is cache-level stale, so we call it acceptable.",
      "catastrophe": "Redis ran out of memory during a traffic spike. Everything went to cache misses, the database melted, and the incident lasted eight hours."
    }
  },
  {
    "id": "inf_012",
    "title": "Observability Platform Upgrade",
    "description": "Implement distributed tracing across all services. Upgrade metrics platform with better cardinality handling. Add synthetic monitoring for critical paths.",
    "category": "infrastructure",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-7, -10], "partial": [-3, -7] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Distributed tracing shows request paths across the system. Debugging time dropped 40% and alerts now fire before users notice problems.",
      "partial_success": "Tracing works for most paths. Async tasks still lack good trace context.",
      "unexpected_impact": "Observability data revealed that 15% of requests time out at layer seven. We did not know that before.",
      "soft_failure": "The platform is more observable. Some teams still do not know how to read the dashboards.",
      "catastrophe": "Cardinality explosion overloaded the metrics database. The monitoring platform became the thing we had to monitor."
    }
  },
  {
    "id": "inf_013",
    "title": "Backup Automation Enhancement",
    "description": "Implement incremental backups and automated retention policies. Test weekly restores to staging. Document recovery procedures and SLA.",
    "category": "infrastructure",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-5, -8], "partial": [-2, -4] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -2], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "Backups are automated and verified weekly. Recovery time is predictable and the team sleeps better.",
      "partial_success": "Backups work automatically. Retention still deletes anything older than 30 days, which seemed fine until you needed it.",
      "unexpected_impact": "Incremental backups saved 60% of storage costs. Someone proposed reinvesting the savings elsewhere.",
      "soft_failure": "Automated backups are reliable. They run at random times and occasionally slow down production.",
      "catastrophe": "A restore test corrupted data. We now had the original problem and corrupted data. The safety net caught fire."
    }
  },
  {
    "id": "inf_014",
    "title": "Performance Profiling Tools",
    "description": "Implement continuous profiling in production. Set up CPU and memory flame graphs. Integrate with observability platform. Automate bottleneck detection.",
    "category": "infrastructure",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-5, -7], "partial": [-2, -5] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-1, -1], "partial": [-1, -1] },
    "outcomes": {
      "clear_success": "Profiling revealed one function consuming 35% of CPU. It took two hours to fix and justified the entire project.",
      "partial_success": "Profiling works but overhead is noticeable. We enable it only during off-peak hours.",
      "unexpected_impact": "Flame graphs are beautiful. Engineers stare at them. Productivity might have declined.",
      "soft_failure": "Profiling is accurate. You just need to know how to read it.",
      "catastrophe": "Profiling overhead caused a timeout cascade during a traffic spike. We turned it off and lost visibility into the problem it would have shown us."
    }
  },
  {
    "id": "inf_015",
    "title": "Network Security Audit",
    "description": "Review firewall rules, network segmentation, and ingress policies. Implement network policies for pod-to-pod communication. Audit TLS certificates and rotation.",
    "category": "infrastructure",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-7, -10], "partial": [-3, -6] },
    "secondary_metric": null,
    "secondary_impact": null,
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": { "success": [-2, -3], "partial": [-1, -2] },
    "outcomes": {
      "clear_success": "Network is segmented properly and TLS certificates rotate automatically. Security is measurably better.",
      "partial_success": "Network policies exist. Debugging blocked traffic takes longer than implementing the rules did.",
      "unexpected_impact": "The audit found services talking to things they should not. Breaking those links revealed unused dependencies.",
      "soft_failure": "Security posture improved and operational complexity rose proportionally.",
      "catastrophe": "A network policy typo isolated a critical service. Database connections failed and the incident lasted 35 minutes."
    }
  },
  {
    "id": "inf_016",
    "title": "Alert Deduping Rules",
    "description": "Reduce duplicate alerts and add noise-suppression rules for on-call. Low effort, immediate sanity gains. Tradeoff: there's a non-zero chance you suppress the wrong thing.",
    "category": "infrastructure",
    "effort": 2,
    "primary_metric": "tech_debt",
    "primary_impact": { "success": [-3, -5], "partial": [-1, -3] },
    "secondary_metric": "team_sentiment",
    "secondary_impact": { "success": [1, 3], "partial": [1, 2] },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Pager noise dropped 40%. The team slept through the night and arrived at standup mildly confused by the silence.",
      "partial_success": "Duplicate alerts are mostly gone. The remaining ones are the worst offenders. It is progress, not peace.",
      "unexpected_impact": "Noise rules suppressed a real incident for 15 minutes. We fixed the rule and added three alerts about the alert rules.",
      "soft_failure": "Deduping only applied to one service. Everything else still screams. The team keeps their ringtones.",
      "catastrophe": "A deduping rule swallowed a critical outage alert. The incident lasted two extra hours while everyone enjoyed their quiet evening."
    }
  }
]
