[
  {
    "id": "td_001",
    "title": "Legacy Auth Service Migration",
    "description": "The authentication microservice is running on deprecated OAuth 1.0 libraries and requires vendor-specific patches to stay functional.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -10
      ],
      "partial": [
        -3,
        -6
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Security stopped asking why we still run OAuth 1.0; the exec summary suddenly has room.",
      "partial_success": "OAuth 2.0 mostly works, but vendor patches are still needed for one legacy customer; the footnote does the heavy lifting.",
      "unexpected_impact": "The new stack is 300ms faster per auth request and exposed a session-storage bottleneck that now looks catastrophic; the roadmap did not mention this part.",
      "soft_failure": "Partial rollout works but rollback requires downtime and the team is now fluent in OAuth 2.0 error codes; the postmortem gets a new slide.",
      "catastrophe": "The new libraries do not support the obscure multi-tenant customer that represents 8% of MRR; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_002",
    "title": "Payment Module Refactor",
    "description": "The payment processing code is entangled across three services with no clear separation of concerns.",
    "category": "tech_debt",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -10,
        -12
      ],
      "partial": [
        -4,
        -7
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        5,
        6
      ],
      "partial": [
        2,
        4
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Payment is now a discrete service and auditors noticed; leadership takes a victory lap.",
      "partial_success": "Two of three services are refactored; we call it progress.",
      "unexpected_impact": "Refactoring revealed we store credit card data in the wrong place; we pretend that was the plan.",
      "soft_failure": "The refactored service is elegant and still not in production because the old system is too risky to replace; we blame 'execution risk'.",
      "catastrophe": "A race condition double-charged customers for three hours; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_003",
    "title": "Database Connection Pooling",
    "description": "The application opens a new database connection per request instead of reusing a pool, causing connection exhaustion during traffic spikes.",
    "category": "tech_debt",
    "effort": 3,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -5,
        -7
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "P99 latency dropped 15% and infra mentioned it in standup; it becomes a QBR 'win'.",
      "partial_success": "Pooling is live but slightly misconfigured and it works anyway, like a calculator with one broken button nobody presses; it still makes the slide deck.",
      "unexpected_impact": "Pooling exposed dozens of leaked connections from error states and fixing those is now on the list, right below everything else; nobody had that in the model.",
      "soft_failure": "Pool size is too small for real traffic patterns and we shifted the problem from connection creation to connection waiting; it goes into the learning pile.",
      "catastrophe": "The pooling library has a memory leak and every deploy increased RAM until production OOMed during peak traffic; update your resume."
    }
  },
  {
    "id": "td_004",
    "title": "Upgrade ORM Version",
    "description": "The ORM library is three major versions behind, which means every dependency scan looks like a crime scene.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -2,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Security is satisfied and vulnerability scans turned green; someone writes \"great job\" in all-hands.",
      "partial_success": "Most tests pass with the new version — three integration tests were skipped because they test deprecated paths; we declare victory and move on.",
      "unexpected_impact": "The ORM is faster and exposed a nasty N+1 query problem; it wasn't in the deck, but sure.",
      "soft_failure": "Upgrade is complete but two custom hooks broke, so we vendor-patched the new version and the benefits are now theoretical; a retro bullet absorbs the pain.",
      "catastrophe": "A migration bug silently corrupted 500 customer records; legal wants a meeting."
    }
  },
  {
    "id": "td_005",
    "title": "Add Monitoring & Alerting",
    "description": "Critical services have no visibility into resource usage or error rates until customers complain.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -8
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "We now catch issues about 20 minutes before support does; the exec summary suddenly has room.",
      "partial_success": "Monitoring is live for core services; the footnote does the heavy lifting.",
      "unexpected_impact": "Metrics revealed constant low-level errors we'd never noticed — panic followed, tickets multiplied; the roadmap did not mention this part.",
      "soft_failure": "Alerts are configured but overly sensitive and the team learned to ignore them, recreating the exact problem we set out to solve; the postmortem gets a new slide.",
      "catastrophe": "Monitoring crashed during the traffic spike it was supposed to detect, making the incident both invisible and worse; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_006",
    "title": "Improve Test Coverage",
    "description": "Test coverage is 52%, which means half the codebase is untested and ready to surprise everyone in production.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -9
      ],
      "partial": [
        -4,
        -6
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Coverage hit 74%; leadership takes a victory lap.",
      "partial_success": "Coverage reached 68%; we call it progress.",
      "unexpected_impact": "New tests uncovered a latent bug in a supposedly stable module; we pretend that was the plan.",
      "soft_failure": "Tests exist but are brittle and require constant fixes; we blame 'execution risk'.",
      "catastrophe": "Tests pass in CI but fail intermittently in production — debugging the test suite now takes longer than fixing actual bugs; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_007",
    "title": "CI/CD Pipeline Optimization",
    "description": "The deployment pipeline takes 35 minutes, of which 24 minutes is unnecessary.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Deploys complete in 12 minutes; it becomes a QBR 'win'.",
      "partial_success": "Pipeline is down to 18 minutes; it still makes the slide deck.",
      "unexpected_impact": "Optimization exposed a hidden race condition in the build cache and builds now fail mysteriously, but faster; nobody had that in the model.",
      "soft_failure": "Optimization introduced an ordering bug and tests sometimes pass, sometimes fail, depending on execution order; it goes into the learning pile.",
      "catastrophe": "The optimized pipeline skipped a critical validation step; update your resume."
    }
  },
  {
    "id": "td_008",
    "title": "Dependency Version Updates",
    "description": "The dependency tree has 47 packages with known security vulnerabilities — the scan report is longer than the README.",
    "category": "tech_debt",
    "effort": 3,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -4,
        -6
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        2,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Dependency audit passed and security removed the item from the risk register; someone writes \"great job\" in all-hands.",
      "partial_success": "Most dependencies updated and three packages broke compatibility; we declare victory and move on.",
      "unexpected_impact": "A safe transitive update changed internal behavior and a subtle error-handling bug now shows up intermittently; it wasn't in the deck, but sure.",
      "soft_failure": "Everything updated successfully and a week later, a security advisory landed for the new version we just installed; a retro bullet absorbs the pain.",
      "catastrophe": "A minor version update included a breaking change that only triggered under production traffic — rollback ensued; legal wants a meeting."
    }
  },
  {
    "id": "td_009",
    "title": "Remove Deprecated Endpoints",
    "description": "Six API endpoints were deprecated 18 months ago and are still in production, haunting the codebase like a to-do list from a previous life.",
    "category": "tech_debt",
    "effort": 3,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -5,
        -7
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Four deprecated endpoints removed and the codebase is measurably less confusing; the exec summary suddenly has room.",
      "partial_success": "Endpoints are marked for deprecation with a 90-day window; the footnote does the heavy lifting.",
      "unexpected_impact": "Removing an endpoint revealed internal services were also calling it and the codebase was more tangled than our diagrams; the roadmap did not mention this part.",
      "soft_failure": "One endpoint is removed, five remain because nobody knows who is using them and the audit trail is ancient; the postmortem gets a new slide.",
      "catastrophe": "We removed an endpoint that a major customer was calling via a typo in their integration; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_010",
    "title": "Consolidate Logging Infrastructure",
    "description": "Logs are written to five different services (file, syslog, application DB, third-party SaaS, and slack in one engineer's DM).",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -10
      ],
      "partial": [
        -3,
        -6
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Logs are in one queryable system and incident debugging is 40% faster; it becomes a QBR 'win'.",
      "partial_success": "Most logs are consolidated and legacy services still write to the old systems because re-instrumentation would take another month; it still makes the slide deck.",
      "unexpected_impact": "Consolidated logs revealed we've been logging sensitive data at INFO level; nobody had that in the model.",
      "soft_failure": "Logging is unified but ingestion costs are higher and search is slower than the scattered mess it replaced; it goes into the learning pile.",
      "catastrophe": "The new logging service crashed during peak traffic and we lost visibility; update your resume."
    }
  },
  {
    "id": "td_011",
    "title": "Fix N+1 Query Problem",
    "description": "The report generation query runs a database hit for each row, creating exponential query volume.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -8
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Report generation is now instant and zero users noticed; someone writes \"great job\" in all-hands.",
      "partial_success": "The N+1 problem is fixed for the main report; we declare victory and move on.",
      "unexpected_impact": "Fixing the query revealed the data model is fundamentally wrong and the fix is correct but only masks a bigger problem; it wasn't in the deck, but sure.",
      "soft_failure": "The new query is fast but uses so much memory that running multiple reports at once crashes the server; a retro bullet absorbs the pain.",
      "catastrophe": "A subtle join bug makes reports show zero data for 15% of customers; legal wants a meeting."
    }
  },
  {
    "id": "td_012",
    "title": "Migrate to New CDN",
    "description": "The legacy CDN is being sunset and costs are tripling — migrate before the invoice arrives.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "CDN migration complete and bandwidth costs dropped 60%; the exec summary suddenly has room.",
      "partial_success": "The new CDN serves images and video is still on the old CDN because the billing relationship is complicated; the footnote does the heavy lifting.",
      "unexpected_impact": "The new CDN is faster but caches more aggressively, so stale content lingers for hours after updates; the roadmap did not mention this part.",
      "soft_failure": "Migration succeeded but the new CDN has different rate limits and we hit them during peak hours; the postmortem gets a new slide.",
      "catastrophe": "A DNS inconsistency during the handoff sent 30% of users to the old CDN; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_013",
    "title": "Containerize Remaining Services",
    "description": "Three services are still running on bare VMs using custom deploy scripts that nobody fully understands.",
    "category": "tech_debt",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -9,
        -12
      ],
      "partial": [
        -4,
        -7
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        5,
        6
      ],
      "partial": [
        2,
        4
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "All services are containerized and infrastructure can manage them programmatically; leadership takes a victory lap.",
      "partial_success": "Two services are containerized and the third has OS-level dependencies that do not play well with containers, so it stayed behind; we call it progress.",
      "unexpected_impact": "Containerization revealed the custom deploy scripts were doing critical undocumented work and replicating them took another week; we pretend that was the plan.",
      "soft_failure": "Services run in containers but performance degraded slightly due to overhead; we blame 'execution risk'.",
      "catastrophe": "A misconfigured volume mount caused data loss during a container restart and two hours of downtime; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_014",
    "title": "API Versioning Cleanup",
    "description": "The API has seven versions in production, four of which are deprecated but still maintained for backward compatibility.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -9
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "API is down to three versions from seven and the test suite runs 40% faster; it becomes a QBR 'win'.",
      "partial_success": "Deprecated versions are marked for removal with six months' notice — only one customer will actually migrate; it still makes the slide deck.",
      "unexpected_impact": "Removing old versions exposed inconsistencies in data handling that nobody knew existed; nobody had that in the model.",
      "soft_failure": "Consolidation completed but introduced subtle behavior changes in rarely used endpoints and customers will notice next month; it goes into the learning pile.",
      "catastrophe": "Version consolidation broke serialization for a custom field type; update your resume."
    }
  },
  {
    "id": "td_015",
    "title": "Cache Invalidation Refactor",
    "description": "Build a centralized feature flag service with a UI for toggling, rollout, and targeting — because everyone having their own flag system is not a system.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -10
      ],
      "partial": [
        -4,
        -6
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Cache is now consistent and stale reads are gone; someone writes \"great job\" in all-hands.",
      "partial_success": "Explicit invalidation exists for critical caches and less important caches still use TTL; we declare victory and move on.",
      "unexpected_impact": "The new invalidation system is correct but slower and we traded throughput for correctness; it wasn't in the deck, but sure.",
      "soft_failure": "Invalidation refactor is complete, and under high load it triggers a thundering herd; a retro bullet absorbs the pain.",
      "catastrophe": "A bug in invalidation caused cache poisoning and stale data persisted indefinitely; legal wants a meeting."
    }
  },
  {
    "id": "td_016",
    "title": "Remove Dead Code",
    "description": "The codebase has 8,000 lines of unreachable code from old features.",
    "category": "tech_debt",
    "effort": 3,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -4,
        -6
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        2,
        3
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Dead code removed and the codebase is 3% smaller; the exec summary suddenly has room.",
      "partial_success": "Most dead code removed and three modules looked dead but are called from tests nobody runs, so they stay; the footnote does the heavy lifting.",
      "unexpected_impact": "Code that looked dead was called via reflection and removing it broke a plugin system nobody knew existed; the roadmap did not mention this part.",
      "soft_failure": "Dead code is gone but git history is now harder to read and we traded cognitive load for archaeology; the postmortem gets a new slide.",
      "catastrophe": "We removed code that was obviously dead but actually called by a customer's custom extension; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_017",
    "title": "Schema Migration Tooling",
    "description": "Database migrations are applied manually and tracked in a spreadsheet maintained by one person who is on vacation.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Migrations now apply automatically and human error is gone; leadership takes a victory lap.",
      "partial_success": "The framework is implemented and complex migrations still require manual intervention, but simple ones are automated; we call it progress.",
      "unexpected_impact": "Automated migrations run faster and exposed race conditions hidden by slow manual processes; we pretend that was the plan.",
      "soft_failure": "Migrations work but rollback is slow and a failed migration now takes hours to undo; we blame 'execution risk'.",
      "catastrophe": "An automated migration ran twice due to an idempotency bug, creating duplicate columns and recovery required manual edits; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_018",
    "title": "Rate Limiter Refactor",
    "description": "Rate limiting is implemented as random backoff in client code, which is ineffective.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -8
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Rate limiter is in place and abuse attempts are rejected gracefully; it becomes a QBR 'win'.",
      "partial_success": "The limiter works for most traffic, but legacy integrations bypass it due to exceptions we granted; it still makes the slide deck.",
      "unexpected_impact": "The limiter is too strict and legitimate traffic spikes now trigger rate limits, so we block our own customers; nobody had that in the model.",
      "soft_failure": "The limiter is implemented but does not coordinate across instances and each server counts independently, making the limit useless at scale; it goes into the learning pile.",
      "catastrophe": "A bug in state storage prevented counters from resetting and every client was rate limited indefinitely; update your resume."
    }
  },
  {
    "id": "td_019",
    "title": "Session Management Overhaul",
    "description": "Session tokens live in-memory and vanish on restart, so every deploy logs out every user — Tuesday mornings are fun.",
    "category": "tech_debt",
    "effort": 3,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -5,
        -7
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": null,
    "tradeoff_impact": null,
    "outcomes": {
      "clear_success": "Sessions persist across deployments and users no longer get logged out on Tuesday mornings; someone writes \"great job\" in all-hands.",
      "partial_success": "Persistent session storage is live, though migration had some bumps; we declare victory and move on.",
      "unexpected_impact": "Persistent sessions revealed how many accounts still use default passwords and they now stay logged in forever; it wasn't in the deck, but sure.",
      "soft_failure": "Session persistence works, but the storage backend is slow and adds 100ms to every request; a retro bullet absorbs the pain.",
      "catastrophe": "A storage bug caused sessions from different customers to collide; legal wants a meeting."
    }
  },
  {
    "id": "td_020",
    "title": "Error Handling Standardization",
    "description": "Error handling is inconsistent across services: some return stack traces, some return codes, some return nothing and hope for the best.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -2,
        -4
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        4
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Error handling is standardized and debugging is possible; leadership takes a victory lap.",
      "partial_success": "Core services are standardized and legacy modules still throw random exceptions like it is 2017; we call it progress.",
      "unexpected_impact": "Standardized errors revealed we return sensitive info in messages and GDPR compliance became someone's new hobby; we pretend that was the plan.",
      "soft_failure": "Standardization worked but the new format is verbose and log storage costs rose 30%; we blame 'execution risk'.",
      "catastrophe": "A bug in the standardization layer made every error look the same and debugging became impossible overnight; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_021",
    "title": "Secrets Management Migration",
    "description": "Secrets are scattered across environment variables and config files with no centralized management, rotation, or audit trail.",
    "category": "tech_debt",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -12
      ],
      "partial": [
        -4,
        -7
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        5,
        6
      ],
      "partial": [
        2,
        4
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Secrets are centralized and auditable; it becomes a QBR 'win'.",
      "partial_success": "Most secrets migrated and legacy services still use env vars because they do not support the new manager; it still makes the slide deck.",
      "unexpected_impact": "Centralizing secrets revealed multiple copies of each secret, some out of sync and we had backups for our backups; nobody had that in the model.",
      "soft_failure": "The secrets manager is in place but adds startup latency; it goes into the learning pile.",
      "catastrophe": "A secrets manager outage cascaded across services; update your resume."
    }
  },
  {
    "id": "td_022",
    "title": "Background Job Queue Upgrade",
    "description": "The job queue runs on an outdated library with no visibility into failure rates or retry logic.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -10
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        4,
        5
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "The job queue now exposes retry logic and failure rates; someone writes \"great job\" in all-hands.",
      "partial_success": "The new queue is live for new jobs and old jobs still run on the legacy system because refactoring them is expensive; we declare victory and move on.",
      "unexpected_impact": "Visibility revealed that 15% of jobs have been silently failing and retrying forever; it wasn't in the deck, but sure.",
      "soft_failure": "Upgrade complete, but the new queue is slower and the performance hit cascades across the platform; a retro bullet absorbs the pain.",
      "catastrophe": "The new queue lost an entire batch of jobs during an upgrade — email sends, report generation, all gone; legal wants a meeting."
    }
  },
  {
    "id": "td_023",
    "title": "Retire Dead Feature Flags",
    "description": "Clean up stale feature flags that have been 'temporary' for over a year — low effort, immediate cognitive relief.",
    "category": "tech_debt",
    "effort": 2,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -4,
        -6
      ],
      "partial": [
        -2,
        -3
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        2,
        3
      ],
      "partial": [
        1,
        2
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Dead flags removed and the codebase is noticeably easier to reason about; the exec summary suddenly has room.",
      "partial_success": "Most flags are gone, but a few are tied to legacy customers and stay; the footnote does the heavy lifting.",
      "unexpected_impact": "Removing a flag exposed a hidden dependency in a cron job and it only worked because the flag defaulted to false; the roadmap did not mention this part.",
      "soft_failure": "Flags were removed in one service and missed in another; the postmortem gets a new slide.",
      "catastrophe": "A dead flag was actually disabling a compliance workflow; everyone pretends it was unforeseeable."
    }
  },
  {
    "id": "td_024",
    "title": "Frontend Build Pipeline Modernization",
    "description": "The frontend still uses Webpack 4 and builds take 12 minutes — switching to Vite would cut that to under a minute and the team would stop complaining.",
    "category": "tech_debt",
    "effort": 5,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -7,
        -9
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "team_sentiment",
    "secondary_impact": {
      "success": [
        4,
        6
      ],
      "partial": [
        2,
        3
      ]
    },
    "tradeoff_metric": "cto_sentiment",
    "tradeoff_impact": {
      "success": [
        2,
        3
      ],
      "partial": [
        1,
        2
      ]
    },
    "outcomes": {
      "clear_success": "Build time dropped from 12 minutes to 45 seconds and developer happiness is measurably up; leadership takes a victory lap.",
      "partial_success": "Build is faster but legacy plugins still run on Webpack and the hybrid setup is brittle; we call it progress.",
      "unexpected_impact": "Fast builds exposed how often code is poorly tested and CI failures doubled because we now actually run tests; we pretend that was the plan.",
      "soft_failure": "Migration complete but production builds are still slow because optimization settings were lost in translation; we blame 'execution risk'.",
      "catastrophe": "A Vite config bug bundled source maps into production and API keys leaked; this becomes a quarterly lesson."
    }
  },
  {
    "id": "td_025",
    "title": "Consolidate Duplicate Libraries",
    "description": "The codebase imports three different date libraries, two HTTP clients, and four logging frameworks — pick one and delete the rest.",
    "category": "tech_debt",
    "effort": 4,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -6,
        -8
      ],
      "partial": [
        -3,
        -5
      ]
    },
    "secondary_metric": "cto_sentiment",
    "secondary_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -1,
        -2
      ],
      "partial": [
        -1,
        -1
      ]
    },
    "outcomes": {
      "clear_success": "Libraries consolidated and bundle size dropped 18%; it becomes a QBR 'win'.",
      "partial_success": "Most duplicates removed but one legacy module needs moment.js and will until heat death; it still makes the slide deck.",
      "unexpected_impact": "Removing libraries exposed behavioral differences between them and some date parsing now works differently; nobody had that in the model.",
      "soft_failure": "Consolidation complete but the chosen library is slower and response times regressed; it goes into the learning pile.",
      "catastrophe": "A timezone bug in the new date library caused invoice generation to shift by one day; update your resume."
    }
  },
  {
    "id": "td_026",
    "title": "Mobile Web Performance Audit",
    "description": "The mobile site loads 4MB of JavaScript and takes 11 seconds on a 3G connection — this is why bounce rate is 60%.",
    "category": "tech_debt",
    "effort": 6,
    "primary_metric": "tech_debt",
    "primary_impact": {
      "success": [
        -8,
        -11
      ],
      "partial": [
        -4,
        -7
      ]
    },
    "secondary_metric": "nps",
    "secondary_impact": {
      "success": [
        3,
        5
      ],
      "partial": [
        1,
        3
      ]
    },
    "tradeoff_metric": "team_sentiment",
    "tradeoff_impact": {
      "success": [
        -2,
        -3
      ],
      "partial": [
        -1,
        -2
      ]
    },
    "outcomes": {
      "clear_success": "Mobile load time dropped to 3 seconds and bounce rate fell to 35%; someone writes \"great job\" in all-hands.",
      "partial_success": "JavaScript reduced to 2MB and load time is 6 seconds; we declare victory and move on.",
      "unexpected_impact": "Optimizations revealed that mobile users behave differently and desktop metrics stopped being predictive; it wasn't in the deck, but sure.",
      "soft_failure": "Audit complete and recommendations exist but implementation stalled because it requires coordination across five teams; a retro bullet absorbs the pain.",
      "catastrophe": "Aggressive code splitting broke lazy loading and mobile users saw blank screens; legal wants a meeting."
    }
  }
]
